Res-firecracker-random-v7/firecracker_t_4_c_6_frontVcpu_2_wrkVcpu_1/wrk.txt
Running 1m test @ http://frontend:5000
  4 threads and 6 connections
  Thread calibration: mean lat.: 5010.648ms, rate sampling interval: 17203ms
  Thread calibration: mean lat.: 5032.314ms, rate sampling interval: 17809ms
  Thread calibration: mean lat.: 5161.345ms, rate sampling interval: 18038ms
  Thread calibration: mean lat.: 4772.269ms, rate sampling interval: 15450ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency    19.23s     9.02s   37.49s    66.24%
    Req/Sec   269.78      3.71   276.00     77.78%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   15.19s 
 75.000%   26.31s 
 90.000%   34.83s 
 99.000%   37.49s 
 99.900%   38.21s 
 99.990%   38.37s 
 99.999%   38.37s 
100.000%   38.37s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

    7700.479     0.000000            1         1.00
    9576.447     0.100000         5432         1.11
   10395.647     0.200000        10862         1.25
   12951.551     0.300000        16270         1.43
   14434.303     0.400000        21725         1.67
   15187.967     0.500000        27160         2.00
   15785.983     0.550000        29824         2.22
   19955.711     0.600000        32529         2.50
   24723.455     0.650000        35241         2.86
   25772.031     0.700000        37993         3.33
   26312.703     0.750000        40669         4.00
   26574.847     0.775000        42044         4.44
   26869.759     0.800000        43423         5.00
   27426.815     0.825000        44726         5.71
   29769.727     0.850000        46075         6.67
   33783.807     0.875000        47432         8.00
   34439.167     0.887500        48123         8.89
   34832.383     0.900000        48826        10.00
   35225.599     0.912500        49487        11.43
   35586.047     0.925000        50175        13.33
   35979.263     0.937500        50839        16.00
   36175.871     0.943750        51177        17.78
   36339.711     0.950000        51535        20.00
   36470.783     0.956250        51875        22.86
   36601.855     0.962500        52192        26.67
   36765.695     0.968750        52542        32.00
   36863.999     0.971875        52735        35.56
   36929.535     0.975000        52867        40.00
   37027.839     0.978125        53032        45.71
   37126.143     0.981250        53200        53.33
   37257.215     0.984375        53400        64.00
   37289.983     0.985938        53451        71.11
   37388.287     0.987500        53564        80.00
   37421.055     0.989062        53614        91.43
   37519.359     0.990625        53730       106.67
   37617.663     0.992188        53798       128.00
   37650.431     0.992969        53829       142.22
   37715.967     0.993750        53887       160.00
   37748.735     0.994531        53916       182.86
   37814.271     0.995313        53966       213.33
   37879.807     0.996094        54022       256.00
   37879.807     0.996484        54022       284.44
   37912.575     0.996875        54052       320.00
   37945.343     0.997266        54066       365.71
   37978.111     0.997656        54085       426.67
   38010.879     0.998047        54105       512.00
   38043.647     0.998242        54120       568.89
   38076.415     0.998437        54128       640.00
   38109.183     0.998633        54135       731.43
   38141.951     0.998828        54142       853.33
   38207.487     0.999023        54158      1024.00
   38207.487     0.999121        54158      1137.78
   38240.255     0.999219        54167      1280.00
   38273.023     0.999316        54174      1462.86
   38273.023     0.999414        54174      1706.67
   38305.791     0.999512        54184      2048.00
   38305.791     0.999561        54184      2275.56
   38305.791     0.999609        54184      2560.00
   38338.559     0.999658        54192      2925.71
   38338.559     0.999707        54192      3413.33
   38338.559     0.999756        54192      4096.00
   38371.327     0.999780        54205      4551.11
   38371.327     1.000000        54205          inf
#[Mean    =    19232.212, StdDeviation   =     9023.667]
#[Max     =    38338.560, Total count    =        54205]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  64547 requests in 1.00m, 26.67MB read
Requests/sec:   1075.79
Transfer/sec:    455.22KB